{
    "articles": [
        {
            "id": 1,
            "component": "ArticleProfile",
            "locales": {},
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc",
                "contact_list_ids": ["address", "email", "phone"],
                "contact_circles_ids": ["instagram", "linkedin", "github"]
            },
            "items": [
                {
                    "id": 1,
                    "locales": {
                        "en": {
                            "description": "I am an experienced Software Data Engineer with <strong>4 years</strong> of expertise in designing and building scalable data infrastructure, cloud native ETL pipelines, and AI powered analytics solutions. Adept in AWS, and Azure ecosystems, with hands on experience in technologies like PySpark, Snowflake, Kafka, Airflow, and DBT. I am a quick learner and always looking for new challenges to grow my skills."
                        },

                        "es": {
                            "description": "Soy un Ingeniero de Datos de Software experimentado con <strong>4 años</strong> de experiencia en el diseño y construcción de infraestructura de datos escalable, pipelines ETL nativos de la nube y soluciones de análisis impulsadas por IA. Experto en ecosistemas AWS y Azure, con experiencia práctica en tecnologías como PySpark, Snowflake, Kafka, Airflow y DBT. Aprendo rápido y siempre estoy buscando nuevos desafíos para desarrollar mis habilidades."
                        },

                        "fr": {
                            "description": "Je suis un Ingénieur de Données Logiciel expérimenté avec <strong>4 ans</strong> d'expertise dans la conception et la construction d'infrastructures de données évolutives, de pipelines ETL natifs du cloud et de solutions d'analyse alimentées par l'IA. Compétent dans les écosystèmes AWS et Azure, avec une expérience pratique dans des technologies comme PySpark, Snowflake, Kafka, Airflow et DBT. J'apprends vite et je suis toujours à la recherche de nouveaux défis pour développer mes compétences."
                        },

                        "zh": {
                            "description": "我是一名经验丰富的软件数据工程师，拥有<strong>4年</strong>的专业经验，专注于设计和构建可扩展的数据基础设施、云原生ETL管道和AI驱动的分析解决方案。精通AWS和Azure生态系统，在PySpark、Snowflake、Kafka、Airflow和DBT等技术方面具有实践经验。我学习能力强，始终寻找新挑战以提升技能。"
                        }
                    }
                },

                {
                    "id": 2,
                    "locales": {
                        "en": {
                            "description": "I believe in the collective power of intellect and creativity to forge the future of technology. Let's connect and transform ideas into reality together!"
                        },

                        "es": {
                            "description": "Creo en el poder colectivo del intelecto y la creatividad para forjar el futuro de la tecnología. ¡Conectemos y transformemos ideas en realidad juntos!"
                        },

                        "fr": {
                            "description": "Je crois au pouvoir collectif de l'intelligence et de la créativité pour façonner l'avenir de la technologie. Connectons-nous et transformons ensemble les idées en réalité !"
                        },

                        "zh": {
                            "description": "我相信智慧与创意的集体力量能够塑造科技的未来。让我们连接彼此，共同将想法变为现实！"
                        }
                    }
                }
            ]
        }
    ]
}