{
    "articles": [
        {
            "id": 1,
            "component": "ArticleTimeline",
            "locales": {},
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "desc"
            },
            "items": [
                {
                    "id": 1,
                    "dateStart": {"year": 2023, "month": 7},
                    "dateEnd": {"year": 2025, "month": 5},
                    "img": "images/places/logo-morgan-stanley.jpg",
                    "fallbackFaIcon": "fa-solid fa-building",
                    "fallbackFaIconColor": "#0052CC",

                    "locales": {
                        "en": {
                            "title": "Full Stack Java Developer",
                            "description": "Developing high-performance <strong>financial systems</strong> and <strong>trading platforms</strong> using modern Java technologies and cloud infrastructure. Leading initiatives to enhance trade settlement processes, improve service availability, and optimize data retrieval systems for banking operations.",
                            "list": {
                                "title": "Key Achievements",
                                "items": [
                                    "Reduced trade settlement time by <strong>40%</strong> by engineering event-driven architecture using Apache Kafka and gRPC.",
                                    "Achieved <strong>99% service availability</strong> by containerizing Spring Boot microservices on Azure Kubernetes Service.",
                                    "Enhanced financial data retrieval speed by <strong>60%</strong> implementing GraphQL APIs with Redis caching.",
                                    "Built secure microservices supporting <strong>KYC, AML, and loan approval</strong> processes with OAuth2.0/JWT authentication.",
                                    "Leveraged Java 21 features including <strong>virtual threads and pattern matching</strong> for high-concurrency processing.",
                                    "Achieved <strong>90%+ test coverage</strong> using JUnit 5, Mockito, and Cucumber (BDD) frameworks.",
                                    "Ensured <strong>PCI-DSS, SOX, and GDPR compliance</strong> with encryption standards and audit trails."
                                ]
                            },
                            "province": "California",
                            "country": "US",
                            "institution": "Morgan Stanley",
                            "tags": ["Java 21", "Spring Boot 3.x", "Apache Kafka", "Azure AKS", "GraphQL", "React.js", "Microservices", "Financial Systems"]
                        },

                        "es": {
                            "title": "Desarrollador Full Stack Java",
                            "description": "Desarrollando sistemas financieros de <strong>alto rendimiento</strong> y <strong>plataformas de trading</strong> utilizando tecnologías Java modernas e infraestructura en la nube. Liderando iniciativas para mejorar los procesos de liquidación de operaciones, mejorar la disponibilidad de servicios y optimizar los sistemas de recuperación de datos para operaciones bancarias.",
                            "list": {
                                "title": "Logros Clave",
                                "items": [
                                    "Reduje el tiempo de liquidación de operaciones en un <strong>40%</strong> diseñando arquitectura impulsada por eventos con Apache Kafka y gRPC.",
                                    "Logré <strong>99% de disponibilidad de servicio</strong> contenerizando microservicios Spring Boot en Azure Kubernetes Service.",
                                    "Mejoré la velocidad de recuperación de datos financieros en un <strong>60%</strong> implementando APIs GraphQL con caché Redis.",
                                    "Construí microservicios seguros que soportan procesos de <strong>KYC, AML y aprobación de préstamos</strong> con autenticación OAuth2.0/JWT.",
                                    "Aproveché las características de Java 21 incluyendo <strong>hilos virtuales y coincidencia de patrones</strong> para procesamiento de alta concurrencia.",
                                    "Logré <strong>más del 90% de cobertura de pruebas</strong> usando frameworks JUnit 5, Mockito y Cucumber (BDD).",
                                    "Aseguré el cumplimiento de <strong>PCI-DSS, SOX y GDPR</strong> con estándares de encriptación y pistas de auditoría."
                                ]
                            },
                            "province": "California",
                            "country": "EE. UU.",
                            "institution": "Morgan Stanley",
                            "tags": ["Java 21", "Spring Boot 3.x", "Apache Kafka", "Azure AKS", "GraphQL", "React.js", "Microservicios", "Sistemas Financieros"]
                        },

                        "fr": {
                            "title": "Développeur Full Stack Java",
                            "description": "Développement de <strong>systèmes financiers haute performance</strong> et de <strong>plateformes de trading</strong> utilisant des technologies Java modernes et une infrastructure cloud. Direction d'initiatives pour améliorer les processus de règlement des transactions, améliorer la disponibilité des services et optimiser les systèmes de récupération de données pour les opérations bancaires.",
                            "list": {
                                "title": "Réalisations Clés",
                                "items": [
                                    "Réduit le temps de règlement des transactions de <strong>40%</strong> en concevant une architecture pilotée par les événements avec Apache Kafka et gRPC.",
                                    "Atteint <strong>99% de disponibilité de service</strong> en conteneurisant les microservices Spring Boot sur Azure Kubernetes Service.",
                                    "Amélioré la vitesse de récupération des données financières de <strong>60%</strong> en implémentant des APIs GraphQL avec cache Redis.",
                                    "Construit des microservices sécurisés supportant les processus <strong>KYC, AML et approbation de prêts</strong> avec authentification OAuth2.0/JWT.",
                                    "Exploité les fonctionnalités Java 21 incluant <strong>les threads virtuels et la correspondance de motifs</strong> pour le traitement haute concurrence.",
                                    "Atteint <strong>plus de 90% de couverture de tests</strong> utilisant les frameworks JUnit 5, Mockito et Cucumber (BDD).",
                                    "Assuré la conformité <strong>PCI-DSS, SOX et GDPR</strong> avec standards de chiffrement et pistes d'audit."
                                ]
                            },
                            "province": "Californie",
                            "country": "États-Unis",
                            "institution": "Morgan Stanley",
                            "tags": ["Java 21", "Spring Boot 3.x", "Apache Kafka", "Azure AKS", "GraphQL", "React.js", "Microservices", "Systèmes Financiers"]
                        },

                        "zh": {
                            "title": "Java全栈开发工程师",
                            "description": "使用现代Java技术和云基础设施开发<strong>高性能金融系统</strong>和<strong>交易平台</strong>。领导改进交易结算流程、提高服务可用性和优化银行业务数据检索系统的举措。",
                            "list": {
                                "title": "主要成就",
                                "items": [
                                    "通过使用Apache Kafka和gRPC设计事件驱动架构，将交易结算时间减少了<strong>40%</strong>。",
                                    "通过在Azure Kubernetes Service上容器化Spring Boot微服务，实现了<strong>99%的服务可用性</strong>。",
                                    "通过实施带Redis缓存的GraphQL API，将金融数据检索速度提高了<strong>60%</strong>。",
                                    "构建了支持<strong>KYC、AML和贷款审批</strong>流程的安全微服务，使用OAuth2.0/JWT认证。",
                                    "利用Java 21特性，包括<strong>虚拟线程和模式匹配</strong>进行高并发处理。",
                                    "使用JUnit 5、Mockito和Cucumber（BDD）框架实现了<strong>90%以上的测试覆盖率</strong>。",
                                    "通过加密标准和审计跟踪确保<strong>PCI-DSS、SOX和GDPR合规性</strong>。"
                                ]
                            },
                            "province": "加利福尼亚州",
                            "country": "美国",
                            "institution": "Morgan Stanley",
                            "tags": ["Java 21", "Spring Boot 3.x", "Apache Kafka", "Azure AKS", "GraphQL", "React.js", "微服务", "金融系统"]
                        }
                    }
                },

                {
                    "id": 2,
                    "dateStart": {"year": 2019, "month": 8},
                    "dateEnd": {"year": 2022, "month": 6},
                    "img": "images/places/Subex-logo.png",
                    "fallbackFaIcon": "fa-solid fa-code",
                    "fallbackFaIconColor": "#FF6B35",

                    "locales": {
                        "en": {
                            "title": "Software Development Engineer",
                            "description": "Developed and maintained <strong>highly scalable backend services</strong> for <strong>Optus mobile</strong> serving 11M+ users, using Java, Spring Boot, and microservices architecture. Led initiatives to optimize fraud detection systems, implement event-driven processing, and architect resilient microservices-based solutions.",
                            "list": {
                                "title": "Key Achievements",
                                "items": [
                                    "Developed and maintained <strong>highly scalable backend services</strong> for Optus mobile, serving 11M+ users, using Java, Spring Boot, and microservices architecture.",
                                    "Optimized <strong>fraud detection performance</strong>, replacing synchronous API calls with Kafka-based event-driven processing, reducing fraud alert delays by 15%.",
                                    "Architected a <strong>resilient microservices-based system</strong> with Docker, Kubernetes, and Jenkins CI/CD pipeline, leading to an 80% improvement in system uptime.",
                                    "Designed and implemented <strong>RESTful APIs</strong> to facilitate seamless third-party service integration and new feature rollouts.",
                                    "Implemented <strong>OAuth 2 for secure user authentication</strong> and authorization, increasing industry security standards by 60%.",
                                    "Led the <strong>migration of databases</strong>, realizing a remarkable 30% optimization in data storage and retrieval for specific use cases.",
                                    "Implemented <strong>gRPC protocol</strong> to handle big data collections and real-time communication more effectively.",
                                    "Integrated <strong>connection pooling using HikariCP</strong> to manage database connections resolving critical production issues.",
                                    "Cut deployment costs by <strong>$2K/month</strong> through containerized microservices and auto-scaling optimizations.",
                                    "Optimized <strong>MongoDB queries</strong> by implementing compound indexes, query tuning, and sharding, reducing execution time from 5-7 seconds to 2-3 seconds."
                                ]
                            },
                            "province": "Bangalore",
                            "country": "India",
                            "institution": "Subex Limited",
                            "tags": ["Java", "Spring Boot", "Kafka", "Docker", "Kubernetes", "OAuth 2", "gRPC", "MongoDB", "Fraud Detection", "Microservices"]
                        },

                        "es": {
                            "title": "Ingeniero de Desarrollo de Software",
                            "description": "Desarrollé y mantuve <strong>servicios backend altamente escalables</strong> para <strong>Optus mobile</strong> sirviendo a más de 11 millones de usuarios, utilizando Java, Spring Boot y arquitectura de microservicios. Lideré iniciativas para optimizar sistemas de detección de fraudes, implementar procesamiento basado en eventos y arquitectar soluciones resilientes basadas en microservicios.",
                            "list": {
                                "title": "Logros Clave",
                                "items": [
                                    "Desarrollé y mantuve <strong>servicios backend altamente escalables</strong> para Optus mobile, sirviendo a más de 11 millones de usuarios, utilizando Java, Spring Boot y arquitectura de microservicios.",
                                    "Optimicé el <strong>rendimiento de detección de fraudes</strong>, reemplazando llamadas API síncronas con procesamiento basado en eventos Kafka, reduciendo los retrasos de alertas de fraude en un 15%.",
                                    "Arquitecturé un <strong>sistema resiliente basado en microservicios</strong> con Docker, Kubernetes y pipeline CI/CD Jenkins, logrando una mejora del 80% en tiempo de actividad del sistema.",
                                    "Diseñé e implementé <strong>APIs RESTful</strong> para facilitar la integración perfecta de servicios de terceros y despliegues de nuevas características.",
                                    "Implementé <strong>OAuth 2 para autenticación segura de usuarios</strong> y autorización, aumentando los estándares de seguridad de la industria en un 60%.",
                                    "Lideré la <strong>migración de bases de datos</strong>, logrando una notable optimización del 30% en almacenamiento y recuperación de datos para casos específicos.",
                                    "Implementé <strong>protocolo gRPC</strong> para manejar colecciones de big data y comunicación en tiempo real de manera más efectiva.",
                                    "Integré <strong>pooling de conexiones usando HikariCP</strong> para gestionar conexiones de base de datos resolviendo problemas críticos de producción.",
                                    "Reduje los costos de despliegue en <strong>$2K/mes</strong> a través de microservicios containerizados y optimizaciones de auto-escalado.",
                                    "Optimicé <strong>consultas MongoDB</strong> implementando índices compuestos, ajuste de consultas y sharding, reduciendo el tiempo de ejecución de 5-7 segundos a 2-3 segundos."
                                ]
                            },
                            "province": "Bangalore",
                            "country": "India",
                            "institution": "Subex Limited",
                            "tags": ["Java", "Spring Boot", "Kafka", "Docker", "Kubernetes", "OAuth 2", "gRPC", "MongoDB", "Detección de Fraudes", "Microservicios"]
                        },

                        "fr": {
                            "title": "Ingénieur de Développement Logiciel",
                            "description": "Développé et maintenu des <strong>services backend hautement évolutifs</strong> pour <strong>Optus mobile</strong> servant plus de 11 millions d'utilisateurs, utilisant Java, Spring Boot et l'architecture de microservices. Dirigé des initiatives pour optimiser les systèmes de détection de fraude, implémenter le traitement basé sur les événements et architecturer des solutions résilientes basées sur les microservices.",
                            "list": {
                                "title": "Réalisations Clés",
                                "items": [
                                    "Développé et maintenu des <strong>services backend hautement évolutifs</strong> pour Optus mobile, servant plus de 11 millions d'utilisateurs, utilisant Java, Spring Boot et l'architecture de microservices.",
                                    "Optimisé les <strong>performances de détection de fraude</strong>, remplaçant les appels API synchrones par un traitement basé sur les événements Kafka, réduisant les délais d'alerte de fraude de 15%.",
                                    "Architecturé un <strong>système résilient basé sur les microservices</strong> avec Docker, Kubernetes et pipeline CI/CD Jenkins, conduisant à une amélioration de 80% du temps de fonctionnement du système.",
                                    "Conçu et implémenté des <strong>APIs RESTful</strong> pour faciliter l'intégration transparente de services tiers et les déploiements de nouvelles fonctionnalités.",
                                    "Implémenté <strong>OAuth 2 pour l'authentification sécurisée des utilisateurs</strong> et l'autorisation, augmentant les standards de sécurité de l'industrie de 60%.",
                                    "Dirigé la <strong>migration des bases de données</strong>, réalisant une optimisation remarquable de 30% dans le stockage et la récupération de données pour des cas d'usage spécifiques.",
                                    "Implémenté le <strong>protocole gRPC</strong> pour gérer plus efficacement les collections de big data et la communication en temps réel.",
                                    "Intégré le <strong>pooling de connexions utilisant HikariCP</strong> pour gérer les connexions de base de données résolvant les problèmes critiques de production.",
                                    "Réduit les coûts de déploiement de <strong>$2K/mois</strong> grâce aux microservices conteneurisés et optimisations d'auto-scaling.",
                                    "Optimisé les <strong>requêtes MongoDB</strong> en implémentant des index composés, le réglage de requêtes et le sharding, réduisant le temps d'exécution de 5-7 secondes à 2-3 secondes."
                                ]
                            },
                            "province": "Bangalore",
                            "country": "Inde",
                            "institution": "Subex Limited",
                            "tags": ["Java", "Spring Boot", "Kafka", "Docker", "Kubernetes", "OAuth 2", "gRPC", "MongoDB", "Détection de Fraude", "Microservices"]
                        },

                        "zh": {
                            "title": "软件开发工程师",
                            "description": "使用Java、Spring Boot和微服务架构为<strong>Optus移动</strong>开发和维护<strong>高度可扩展的后端服务</strong>，服务超过1100万用户。领导优化欺诈检测系统、实施事件驱动处理和架构弹性微服务解决方案的举措。",
                            "list": {
                                "title": "主要成就",
                                "items": [
                                    "使用Java、Spring Boot和微服务架构为Optus移动开发和维护<strong>高度可扩展的后端服务</strong>，服务超过1100万用户。",
                                    "优化<strong>欺诈检测性能</strong>，用基于Kafka的事件驱动处理替代同步API调用，将欺诈警报延迟减少15%。",
                                    "使用Docker、Kubernetes和Jenkins CI/CD管道架构<strong>弹性微服务系统</strong>，系统正常运行时间提高80%。",
                                    "设计并实施<strong>RESTful API</strong>以促进第三方服务的无缝集成和新功能发布。",
                                    "实施<strong>OAuth 2安全用户身份验证</strong>和授权，将行业安全标准提高60%。",
                                    "领导<strong>数据库迁移</strong>，在特定用例中实现数据存储和检索30%的显著优化。",
                                    "实施<strong>gRPC协议</strong>以更有效地处理大数据集合和实时通信。",
                                    "使用HikariCP集成<strong>连接池</strong>来管理数据库连接，解决关键生产问题。",
                                    "通过容器化微服务和自动扩展优化将部署成本削减<strong>每月$2K</strong>。",
                                    "通过实施复合索引、查询调优和分片优化<strong>MongoDB查询</strong>，将执行时间从5-7秒减少到2-3秒。"
                                ]
                            },
                            "province": "班加罗尔",
                            "country": "印度",
                            "institution": "Subex Limited",
                            "tags": ["Java", "Spring Boot", "Kafka", "Docker", "Kubernetes", "OAuth 2", "gRPC", "MongoDB", "欺诈检测", "微服务"]
                        }
                    }
                }
            ]
        }
    ]
}